tutorials/floatRigidBody/trial_cases/floatRigidBody_monolithic_rho1140/0.orig/U
/*--------------------------------*- C++ -*----------------------------------* \
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
      type              waveVelocity;
        value           uniform (0 0 0);
    }
    outlet
    {
      type            waveVelocity;
        value           uniform (0 0 0);
    }
    stationaryWalls
    {
        type            noSlip;
    }
    ground
    {
        type            noSlip;
    }
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
        floatingObject
    {
        type            movingWallVelocity;
        slip            yes;
        value           uniform (0 0 0);
	}
}


// ************************************************************************* //
