tutorials/floatRigidBody/trial_cases/floatRigidBody_monolithic_rho1140/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicMotionSolverFvMesh;

motionSolverLibs    ("libfiniteVolumeBeamMooring");

motionSolver        sixDoFRigidBodyMotionFvBeam;

sixDoFRigidBodyMotionFvBeamCoeffs
{
    patches         (floatingObject);

    // Points within innerDistance of the box move rigidly; beyond
    // outerDistance they are fixed
    innerDistance   0.01;
    outerDistance   0.1;

    //- modified mesh morphing parameters
    //-----------------------------------
    containOuterDistance   0;
    xDistance    0.3;
    yDistance    0.15;
    //-----------------------------------  
    
    // Box 0.1 x 0.05 x 0.05 m, half submerged (draft 0.025 m, water at
    // z = 0, as in the MoorDyn case). Buoyancy = 998.2*0.1*0.05*0.025*g = 0.124775 kg * g. The
    // line has no pretension. mass and momentOfInertia are those of the
    // MoorDyn reference case (foamMooring/floatRigidBody_moorDyn), so that
    // the box is the same in both. With rho = 1140 and no buoyancy on the
    // line, it pulls down on the box with 0.0208 N (z of Q on the right
    // patch of 0.orig/beamone/Q), more than the 0.0045 N this mass
    // balances, so the box is not in vertical equilibrium at t = 0 and
    // settles about 0.3 mm lower.
    mass            0.124316;
    centreOfMass    (0.5 0.025 0);
    orientation     (1 0 0 0 1 0 0 0 1);

    // Solid box: m*(Ly^2 + Lz^2, Lx^2 + Lz^2, Lx^2 + Ly^2)/12
    momentOfInertia (5.1800e-05 1.2950e-04 1.2950e-04);

    report          on;

    // Not used by beamFoamCoupled, which accepts beamFoam's body state as it
    // is; kept so the dictionary matches floatRigidBody_partioned
    accelerationRelaxation 0.4;

    // Body and line solved monolithically in beamFoam's BlockEigen system
    solver
    {
        type            beamFoamCoupled;
    }

    // The box spans the tank width: surge, heave and pitch only. It is also
    // hydrostatically unstable in roll (GM < 0), so without these
    // constraints roll grows and the run diverges at about t = 1.07 s.
    // beamFoamCoupled applies them inside the monolithic solve
    constraints
    {
        xzPlane
        {
            sixDoFRigidBodyMotionFvBeamConstraint plane;
            normal (0 1 0);
        }
        yAxis
        {
            sixDoFRigidBodyMotionFvBeamConstraint axis;
            axis (0 1 0);
        }
    }

    // Single line from the anchor (left) to the box (right): see beamInit
    restraints
    {
        beamone
        {
            sixDoFRigidBodyMotionFvBeamRestraint finiteVolumeBeam;
            attachmentPatch right;
            anchorPatch     left;
            beamRegion      "beamone";
            refAttachmentPt (0.45 0.025 -0.025);
        }
    }
}

// ************************************************************************* //
